tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ldez/tap'
tap 'buildpack/tap'

# System tools
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'screen'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'
brew 'exa'

# Development &amp; Power Tools
cask 'iterm2'
cask 'visual-studio-code'
cask 'ngrok'
cask 'postman'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'bat'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'interactive-rebase-tool'
brew 'prm'
brew 'go'
brew 'golangci-lint'
brew 'fzf'
brew 'fd'
brew 'hub'
brew 'jq'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'protobuf'
brew 'prototool'
brew 'dog'
brew 'ripgrep'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'direnv'
brew 'bats'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'duf'
cask 'stats'

# Commit signing
#brew 'pinentry-mac'
#brew 'gnupg'
cask 'gpg-suite'
#brew 'gpg2'

# Containers
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
brew 'graphviz'
cask 'docker' # docker for desktop
brew 'pack'
brew 'ko'
cask 'lens'
cask 'upwork'

# Desktop Software
cask 'clipy'
cask 'recordit'
cask 'slack'
cask 'rectangle'
cask 'google-chrome'